---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.SystemClassification
source: html/ae62e82f-8367-ffc3-8268-6079a546841f.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.SystemClassification Property

The system classification of the pipe fitting or pipe accessory.

## Syntax (C#)
```csharp
public MEPSystemClassification SystemClassification { get; }
```